chengping1970/STM8S207/sw_i2c.c
	for (count = 0;count < 8;count++)
	{
		if (value&0x80)
		{
			GPIO_WriteHigh(IIC_PORT,IIC_SDA_pin[IIC_bus_no]);
		}
		else
		{
			GPIO_WriteLow(IIC_PORT,IIC_SDA_pin[IIC_bus_no]);
		}
		_Delay_5us();
		GPIO_WriteHigh(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
		_Delay_5us();
		GPIO_WriteLow(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
		value = value<<1;
	}
	GPIO_WriteHigh(IIC_PORT,IIC_SDA_pin[IIC_bus_no]);
	GPIO_Init(IIC_PORT, IIC_SDA_pin[IIC_bus_no], GPIO_MODE_IN_FL_NO_IT);
	_Delay_5us();
	GPIO_WriteHigh(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
	for (count = 0;count < IIC_ACK_TIMEOUT;count++)
	{
		if (GPIO_ReadInputPin(IIC_PORT, IIC_SDA_pin[IIC_bus_no]) == 0)
		{
			GPIO_WriteLow(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
			GPIO_Init(IIC_PORT, IIC_SDA_pin[IIC_bus_no], GPIO_MODE_OUT_OD_LOW_FAST);
			return IIC_OK;
		}
	}
	GPIO_WriteLow(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
	GPIO_Init(IIC_PORT, IIC_SDA_pin[IIC_bus_no], GPIO_MODE_OUT_OD_HIZ_FAST);
	
	return IIC_FAIL;
}

/*==========================================================================*/
static u8 _SWI2C_ReceiveByte(u8 send_ack)
{
	u8 count, read, value = 0;

	GPIO_Init(IIC_PORT, IIC_SDA_pin[IIC_bus_no], GPIO_MODE_IN_FL_NO_IT);
	for (count = 0;count < 8;count++)
	{
		_Delay_5us();
		GPIO_WriteHigh(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
		if (GPIO_ReadInputPin(IIC_PORT, IIC_SDA_pin[IIC_bus_no]))
		{
			read = 1;
		}
		else
		{
			read = 0;
		}
		value = (value<<1)|read;
		_Delay_5us();
		GPIO_WriteLow(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
	}
	GPIO_Init(IIC_PORT, IIC_SDA_pin[IIC_bus_no], GPIO_MODE_OUT_OD_HIZ_FAST);
	if (send_ack)
	{
		GPIO_WriteLow(IIC_PORT,IIC_SDA_pin[IIC_bus_no]);
	}
	else
	{
		GPIO_WriteHigh(IIC_PORT,IIC_SDA_pin[IIC_bus_no]);
	}
	_Delay_5us();
	GPIO_WriteHigh(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
	_Delay_5us();
	GPIO_WriteLow(IIC_PORT,IIC_SCL_pin[IIC_bus_no]);
	_Delay_5us();

	return	value;		
}
/*==========================================================================*/
static u8 SWI2C_GetSignalStatus(void)
{
	u8 port_status, port_sel;
	#if CHECK_SIGNAL_RESOLUTION
	u8 val;
	u16 HActive, VActive;
	#endif
	port_sel = IR_GetHDMIPort();
	if (port_sel)
	{
		SWI2C_ReadByte(0x90, 0x0B, &port_status);
	}
	else
	{
		SWI2C_ReadByte(0x90, 0x0A, &port_status);
	}
	#if CHECK_SIGNAL_RESOLUTION
	SWI2C_ReadByte(0x90, 0x9F, &val);
	HActive = val&0x3F;
	HActive = HActive<<8;
	SWI2C_ReadByte(0x90, 0x9E, &val);
	HActive += val;
	SWI2C_ReadByte(0x90, 0xA4, &val);
	VActive = val&0xF0;
	VActive = VActive<<4;
	SWI2C_ReadByte(0x90, 0xA5, &val);
	VActive += val;
	#endif
	if ((port_status&0x0C) == 0x0C)
	{
		#if CHECK_SIGNAL_RESOLUTION
		if (HActive == 3840 && VActive == 2160)
		#endif
		{
			return 1;
		}
	}
	
	return 0;
}
/*==========================================================================*/
#if WRITE_WEAVING_TABLE
static const u8 weaving_table[] =
{
#include "weaving_default.txt"
};
static void FPGA_WriteWeavingTable(void)
{
	u16 i;
	
	SWI2C_WriteByte(FPGA_ADDRESS, 0x4A, 0x25);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xC6, 0x01);
	for (i = 0; i < sizeof(weaving_table); i++)
	{
		SWI2C_WriteByte(FPGA_ADDRESS, 0xC7, weaving_table[i]);
	}
	SWI2C_WriteByte(FPGA_ADDRESS, 0xC6, 0x02);
}
#endif
/*==========================================================================*/
#if TEST_WEAVING_TABLE
static const u8 test_weaving_table[4][] =
{
	{
		#include "weaving_pc.txt"
	},
	{
		#include "weaving_select.txt"
	},
	{
		#include "weaving_old.txt"
	},
	{
		#include "weaving_default.txt"
	}
};

void SWI2C_WriteWeavingTable(u8 index)
{
	u16 i;

	GPIO_WriteLow(LED_R_PORT, LED_R_PIN);			
	GPIO_WriteLow(LED_G_PORT, LED_G_PIN);
	SWI2C_WriteByte(FPGA_ADDRESS, 0x4A, 0x25);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xC6, 0x01);
	for (i = 0; i < 1028; i++)
	{
		SWI2C_WriteByte(FPGA_ADDRESS, 0xC7, test_weaving_table[index][i]);
	}
	SWI2C_WriteByte(FPGA_ADDRESS, 0xC6, 0x02);
	if (I2C_stop)
	{
		GPIO_WriteHigh(LED_R_PORT, LED_R_PIN);			
		GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
	}
	else
	{
		GPIO_WriteLow(LED_R_PORT, LED_R_PIN);			
		GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
	}
}
#endif
/*==========================================================================*/
u8 SWI2C_TestDevice(u8 addr)
{
	u8 result;
	
	_SWI2C_SetBusID(addr);
	_SWI2C_Start();
	result = _SWI2C_SendByte(addr);
	_SWI2C_Stop();

	return result;
}
/*==========================================================================*/
u8 SWI2C_ReadByte(u8 addr, u8 subaddr, u8 * pValue)
{
	return SWI2C_ReadBytes(addr, subaddr, 1, pValue);
}
/*==========================================================================*/
u8 SWI2C_ReadBytes(u8 addr, u8 subaddr, u8 number, u8 * p_data)
{	
	u8 result;

	_SWI2C_SetBusID(addr);
	_SWI2C_Start();
	result = _SWI2C_SendByte(addr);
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	result = _SWI2C_SendByte(subaddr);
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	_SWI2C_Start();
	result = _SWI2C_SendByte(addr|0x01);
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	while (number--)
	{
		*p_data = _SWI2C_ReceiveByte(number);
		p_data++;
	}
	_SWI2C_Stop();

	return IIC_OK;
}
/*==========================================================================*/
u8 SWI2C_WriteByte(u8 addr, u8 subaddr, u8 value)
{	
	return SWI2C_WriteBytes(addr, subaddr, 1, &value);
}
/*==========================================================================*/
u8 SWI2C_Write2Byte(u8 addr, u8 subaddr, u16 data) 
{
	u8 result;

	_SWI2C_SetBusID(addr);
	_SWI2C_Start();                              
	result = _SWI2C_SendByte(addr);  
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	result = _SWI2C_SendByte(subaddr);     
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	result = _SWI2C_SendByte(data>>8);     
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	result = _SWI2C_SendByte(data);   
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	_SWI2C_Stop();    
	return IIC_OK;
}      
/*==========================================================================*/
u8 SWI2C_WriteBytes(u8 addr, u8 subaddr, u8 number, u8 * p_data)
{
	u8 result;

	_SWI2C_SetBusID(addr);
	_SWI2C_Start();
	result = _SWI2C_SendByte(addr);
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	result = _SWI2C_SendByte(subaddr);
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	while (number--)
	{
		result = _SWI2C_SendByte(*p_data);
		if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
		p_data++;
	}
	_SWI2C_Stop();
	return IIC_OK;
}
/*==========================================================================*/
void SWI2C_VerifyKey(void)
{
#if	FPGA_KEY_VERIFY
	u8 secret_key[4], convert_key[4], secret_status;
	SWI2C_ReadByte(FPGA_ADDRESS, 0x19, &secret_status);
	if ((secret_status&0x03) == 1)
	{
		SWI2C_ReadBytes(FPGA_ADDRESS, 0x10, 4, secret_key);
		convert_key[0] = secret_key_table1[secret_key[0]];
		convert_key[1] = secret_key_table2[secret_key[1]];
		convert_key[2] = secret_key_table3[secret_key[2]];
		convert_key[3] = secret_key_table4[secret_key[3]];
		SWI2C_WriteBytes(FPGA_ADDRESS, 0x14, 4, convert_key);
		secret_status = secret_status|0x07;
		SWI2C_WriteByte(FPGA_ADDRESS, 0x19, secret_status);
	}
#endif
}
/*==========================================================================*/
void SWI2C_Init(void)
{
	GPIO_Init(IIC_PORT, IIC_SCL0_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
	GPIO_Init(IIC_PORT, IIC_SDA0_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
	GPIO_Init(IIC_PORT, IIC_SCL1_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
	GPIO_Init(IIC_PORT, IIC_SDA1_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
	GPIO_WriteHigh(IIC_PORT,IIC_SCL0_PIN);
	GPIO_WriteHigh(IIC_PORT,IIC_SDA0_PIN);
	GPIO_WriteHigh(IIC_PORT,IIC_SCL1_PIN);
	GPIO_WriteHigh(IIC_PORT,IIC_SDA1_PIN);

	GPIO_Init(POWER_ONOFF_PORT, POWER_ONOFF_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	
	GPIO_Init(FPGA_RESET_PORT, FPGA_RESET_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	GPIO_Init(IT680X_RESET_PORT, IT680X_RESET_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	
	GPIO_Init(LED_R_PORT, LED_R_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);	
	GPIO_Init(LED_G_PORT, LED_G_PIN, GPIO_MODE_OUT_PP_LOW_FAST);

	GPIO_Init(HDMI0_HOTPLUG_PORT, HDMI0_HOTPLUG_PIN, GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_WriteLow(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
	GPIO_Init(HDMI1_HOTPLUG_PORT, HDMI1_HOTPLUG_PIN, GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_WriteLow(HDMI1_HOTPLUG_PORT,HDMI1_HOTPLUG_PIN);
	
	GPIO_Init(BACKLIGHT_ONOFF_PORT, BACKLIGHT_ONOFF_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	GPIO_Init(BACKLIGHT_PWM_PORT, BACKLIGHT_PWM_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	GPIO_Init(VPANEL_ONOFF_PORT, VPANEL_ONOFF_PIN, GPIO_MODE_OUT_PP_LOW_FAST);
	
	TIM1_TimeBaseInit(0, TIM1_COUNTERMODE_UP, 4095, 0);
	TIM1_OC1Init(TIM1_OCMODE_PWM2, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_DISABLE,
	           1350, TIM1_OCPOLARITY_LOW, TIM1_OCNPOLARITY_HIGH, TIM1_OCIDLESTATE_SET,
	           TIM1_OCNIDLESTATE_RESET);
	TIM1_Cmd(ENABLE);
	TIM1_CtrlPWMOutputs(ENABLE);
#if MHL_IIC_ERROR_RESET
	I2C_error_count = 0;
#endif
}
/*==========================================================================*/
void SWI2C_Update(void)
{	
	if (Backlight_on_timer == TIMER_EXPIRED)
	{
		SET_BACKLIGHT_ON();
		Backlight_on_timer = TIMER_STOPPED;
		//SWI2C_ToggleI2CMode();
	}

