chengping1970/STM8S207/sw_i2c.c
	if (Power_status && !I2C_stop)
	{
		IT6802_fsm();

		if (frc_update_timer == TIMER_EXPIRED && Have_FRC)
		{
			u8 read_LVDS_mode, read_MFC;
			SWI2C_ReadByte(FRC_BOARD_ADDRESS, 0x18, &read_LVDS_mode);
			if (read_LVDS_mode != LVDS_mode)
			{
				SWI2C_WriteByte(FRC_BOARD_ADDRESS, 0x18, LVDS_mode);
			}
			SWI2C_ReadByte(FRC_BOARD_ADDRESS, 0x0A, &read_MFC);
			if (read_MFC != 0)
			{
				IR_DelayNMiliseconds(50);
				SWI2C_WriteByte(FRC_BOARD_ADDRESS, 0x0A, 0);
			}
			frc_update_timer = FRC_UPDATE_TIME;
		}	

#if FPGA_KEY_VERIFY_AUTO
		if (secret_detect_timer == TIMER_EXPIRED)
		{
			SWI2C_VerifyKey();
			secret_detect_timer = SECRET_DETECT_TIME;
		}
#endif
		if (signal_detect_timer == TIMER_EXPIRED)
		{
			
			u8 current_signal_status;
			
			signal_detect_timer = SINGNAL_TETECT_TIME;
			current_signal_status = SWI2C_GetSignalStatus();
			if (current_signal_status != signal_status)
			{
				singal_change_count++;
				if (current_signal_status && singal_change_count > SIGNAL_STABLE_COUNT)
				{
					signal_status = TRUE;
					GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
					#if START_RESET_HDMI
					SWI2C_ResetHDMI();
					#endif
					SWI2C_ResetFPGA();
					SET_VPANEL_ON();
					Backlight_on_timer = BACKLIGHT_DELAY_TIME;
				}
				else if (!current_signal_status && singal_change_count > NO_SIGNAL_COUNT)
				{
					signal_status = FALSE;
					Backlight_on_timer = TIMER_STOPPED;
					SET_BACKLIGHT_OFF();
					IR_DelayNMiliseconds(200);
					SET_VPANEL_OFF();
				}
			}
			else
			{
				singal_change_count = 0;
			}			

			if (signal_status)
			{
				GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
			}
			else
			{
				GPIO_WriteReverse(LED_G_PORT, LED_G_PIN);
			}
		}	
	}
}
/*==========================================================================*/
void SWI2C_SystemPowerUp(void)
{
	GPIO_WriteLow(POWER_ONOFF_PORT, POWER_ONOFF_PIN);
	GPIO_WriteLow(LED_R_PORT, LED_R_PIN);			
	GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
	IR_DelayNMiliseconds(50);
	Power_status = TRUE;
	GPIO_WriteLow(IT680X_RESET_PORT, IT680X_RESET_PIN);
	//GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
	IR_DelayNMiliseconds(200);
	GPIO_WriteHigh(IT680X_RESET_PORT, IT680X_RESET_PIN);
	//GPIO_WriteHigh(FPGA_RESET_PORT, FPGA_RESET_PIN);
	IR_DelayNMiliseconds(200);
	IT6802_fsm_init();
	Have_FRC = SWI2C_TestDevice(FRC_BOARD_ADDRESS);
#if ENABLE_HDMI_HPD
	GPIO_WriteHigh(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
	GPIO_WriteHigh(HDMI1_HOTPLUG_PORT,HDMI1_HOTPLUG_PIN);
	IR_DelayNMiliseconds(2000);
	GPIO_WriteLow(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
	GPIO_WriteLow(HDMI1_HOTPLUG_PORT,HDMI1_HOTPLUG_PIN);
#endif
	singal_change_count = 0;
	signal_status = FALSE;
}
/*==========================================================================*/
void SWI2C_ResetFPGA(void)
{
	if (Power_status)
	{		
		GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(200);
		GPIO_WriteHigh(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(1500);
#if WRITE_WEAVING_TABLE
		FPGA_WriteWeavingTable();
#endif
		FPGA_Init();
	}
}
/*==========================================================================*/
void SWI2C_ResetHDMI(void)
{
	if (Power_status)
	{
		GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(200);
		GPIO_WriteHigh(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(500);
		SWI2C_WriteByte(0x90, 0x14, 0xFF);
		IR_DelayNMiliseconds(1000);
		SWI2C_WriteByte(0x90, 0x14, 0x0);
	}
}
/*==========================================================================*/
void SWI2C_SystemPowerDown(void)
{
	SET_BACKLIGHT_OFF();
	IR_DelayNMiliseconds(200);
	SET_VPANEL_OFF();
	GPIO_WriteHigh(POWER_ONOFF_PORT, POWER_ONOFF_PIN);
	GPIO_WriteHigh(LED_R_PORT, LED_R_PIN);			
	GPIO_WriteLow(LED_G_PORT, LED_G_PIN);
#if ENABLE_HDMI_HPD
	GPIO_WriteHigh(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
	GPIO_WriteHigh(HDMI1_HOTPLUG_PORT,HDMI1_HOTPLUG_PIN);
#endif
	Backlight_on_timer = TIMER_STOPPED;
	Power_status = FALSE;
	I2C_stop = FALSE;
}
/*==========================================================================*/
void SWI2C_ToggleI2CMode(void)
{
	if (Power_status)
	{
		I2C_stop = !I2C_stop;
		if (I2C_stop)
		{
			GPIO_WriteHigh(LED_R_PORT, LED_R_PIN);			
			GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
		}
		else
		{
			GPIO_WriteLow(LED_R_PORT, LED_R_PIN);			
			GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
		}
	}
}
/*==========================================================================*/
void SWI2C_ProcessPower(void)
{
	if (Power_status)
	{
		SWI2C_SystemPowerDown();
	}
	else
	{
		SWI2C_SystemPowerUp();
	}
}
/*==========================================================================*/
static u8 Set3DOn = FALSE;

static void SWI2C_Set3DOnOff(u8 OnOff)
{
	u8 reg_value, insert, retry;
	if (OnOff)
	{
		reg_value = 0x80;
		insert = 0;
	}
	else
	{
		reg_value = 0x0;
		insert = 1;
	}
	for (retry = 0; retry < 3; retry++)
	{
		u8 value;
		SWI2C_WriteByte(FPGA_ADDRESS, 0x57, reg_value);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x3A, insert);
		SWI2C_ReadByte(FPGA_ADDRESS, 0x57, &value);
		if (value == reg_value)
		{
			break;
		}
	}
}
/*==========================================================================*/
void SWI2C_Toggle3DOnOff(void)
{	
	Set3DOn = !Set3DOn;
	SWI2C_Set3DOnOff(Set3DOn);
}
/*==========================================================================*/
extern const u8 address_table[];
extern const u8 table_size;

void FPGA_Init(void)
 {	
 	u8 i;
	for (i = 0; i < table_size; i++)
	{
		SWI2C_WriteByte(FPGA_ADDRESS, address_table[i], FLASH_ReadByte(EEPROM_START_ADDRESS + 1 + i));
	}
	if (FLASH_ReadByte(EEPROM_START_ADDRESS + 1))
	{
		Set3DOn = TRUE;
	}
	SWI2C_WriteByte(FPGA_ADDRESS, 0x19, 0x04);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE0, 0x11);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE1, 0x32);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE2, 0x54);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE3, 0x76);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE4, 0x07);
	SWI2C_Set3DOnOff(Set3DOn);	
}
/*==========================================================================*/
void HDMI_HotPlug(u8 value)
{
	if (value)
	{
		GPIO_WriteLow(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
		GPIO_WriteLow(HDMI1_HOTPLUG_PORT,HDMI1_HOTPLUG_PIN);
	}
	else
	{
		GPIO_WriteHigh(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
		GPIO_WriteHigh(HDMI0_HOTPLUG_PORT,HDMI0_HOTPLUG_PIN);
	}
}
/*==========================================================================*/
static const u8 deep_value[6][3] =
{
	//* 0x59 0x5C 0x5A 
	{0x30, 0x80, 0x60},
	{0x50, 0x70, 0x70},
	{0x70, 0x60, 0x80},
	{0x90, 0x50, 0x90},
	{0xA0, 0x40, 0xA0},
	{0xA8, 0x30, 0xA0},
	};
void SWI2C_Set_deep(u8 deep)
{
	if (deep == 0)
	{
		SWI2C_WriteByte(FPGA_ADDRESS, 0x59, FLASH_ReadByte(0x4000 + REG_0x59 + 1));
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5C, FLASH_ReadByte(0x4000 + REG_0x5C + 1));
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5A, FLASH_ReadByte(0x4000 + REG_0x5A + 1));
	}
	else
	{
		SWI2C_WriteByte(FPGA_ADDRESS, 0x59, deep_value[deep][0]);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5C, deep_value[deep][1]);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5A, deep_value[deep][2]);
	}
}
/*==========================================================================*/
#if MHL_IIC_ERROR_RESET
void SWI2C_ErrorProcess(void)
{
	I2C_error_count++;
	if (I2C_error_count > 50)
	{
		DEBUG_PRINTF(printf("I2C Error, reboot!!!"));
		IR_DelayNMiliseconds(1000);
		WWDG->CR |= 0x80;
		WWDG->CR &= ~0x40;
	}
}
#endif
/*==========================================================================*/
void SWI2C_UpdateTimer(void)
{
	if (frc_update_timer > TIMER_EXPIRED)
	{
		frc_update_timer--;
	}
	
	if (Backlight_on_timer > TIMER_EXPIRED)
	{
		Backlight_on_timer--;
	}
#if FPGA_KEY_VERIFY_AUTO
	if (secret_detect_timer > TIMER_EXPIRED)
	{
		secret_detect_timer--;
	}	
#endif
	if (signal_detect_timer > TIMER_EXPIRED)
	{
		signal_detect_timer--;
	}		
}
/*==========================================================================*/

